export const MENU_ITEMS = [
  { name: "แนะนำแนวข้อสอบ", link: "#exam" },
  { name: "Mock Test", link: "#mock-test" },
  { name: "สนใจลองทำ", link: "#try-it" },
];


export const BOOK_ITEMS = [
  {
    title: "ตะลุยโจทย์ CLOZE 500 ข้อ",
    description: "สรุปเข้ม GRAMMA & VOCAB พร้อมแนวข้อสอบ CLOZE 500 ข้อ ครบทุกประเด็น",
    price: "246",
    badge: "MUST READ",
    image: "/books/1.jpg",
    status: "เล่มพิมพ์นิยม",
    link : "https://s.shopee.co.th/1BEUd5z4OT"
  },
  {
    title: "กรมศุลกากร เตรียมสอบทุกตำแหน่ง 2569",
    description: "อัปเดตพิกัดล่าสุด 2569 แยกหมวดหมู่ชัดเจน อ่านจบทำข้อสอบพิกัดได้แน่นอน",
    price: "500",
    badge: "",
    image: "/books/2.jpg",
    status: "ขายดีที่สุด",
    link : "https://s.shopee.co.th/2g3I94HYBx"
  },
  {
    title: "ความรู้ทั่วไป & TOEIC นักวิชาการศุลกากร 2569",
    description: "รวมทุกเรื่องที่กรมศุลกากรให้ความสำคัญ TOEIC 100 เทคนิค",
    price: "545",
    badge: "NEW",
    image: "/books/3.jpg",
    status: "เนื้อหาอัปเดต",
    link : "https://s.shopee.co.th/VyluWXnQu"
  }
];


export const PREVIEW_IMAGES = [
  {
    title: "Mock Test ข้อสอบนักวิชาการศุลกากร มีมากกว่า 1,000 ข้อ แยกระดับความยากง่าย",
    description: "Mock Test แนวข้อสอบนักวิชาการศุลกากร พร้อมเฉลยแสดงข้อผิด เมื่อทำเสร็จข้อสอบ ข้อสอบแยกระดับความยากง่าย โดยสีเหลืองจะเป็นข้อสอบง่าย โจทย์ถามตรงตัวมี ช้อย 4 ช้อย สีส้มความยากระดับปานกลางวัดความแม่นยำของตัวบทกฎหมาย ส่วนสีแดงจะยากที่สุดโดยจะเป็นข้อสอบ A B C ",
    image: "/จำนวนแบบทดสอบ.png", // เปลี่ยนเป็นพาธรูปของคุณ
    tag: "Interface"
  },
  {
    title: "ข้อสอบชุด ตต Test นวก.ศุล มีทั้งหมด 10 ชุด ชุดละ 100 ข้อ",
    description: "Mock Test แนวข้อสอบนักวิชาการศุลกากร รวมทุกหัวข้อที่คิดว่าน่าจะออกสอบให้ทำจนจุใจ คละเรื่องเพื่อซ้อมเข้าสู่สนามจริง ทำเสร็จแล้วส่งมีเฉลยข้อที่ผิดออกมา",
    image: "/exams/2.jpg",
    tag: "Explanation"
  },
  {
    title: "ชุด Mock Test ข้อสอบนักวิชาการศุลกากรปฏิบัติการ ระดับสีส้ม วัดความแม่นยำของตัวบทกฎหมายสำหรับคนอ่านมานาน",
    description: "ชุด Mock Test ข้อสอบนักวิชาการศุลกากร วัดความแม่นยำของตัวบทพระราชบัญญัติศุลกากร พ.ศ. ๒๕๖๐ และพระราชกำหนดพิกัดอัตราศุลกากร พ.ศ.๒๕๓๐ เพื่อให้ไม่พลาดคะแนนแม้แต่มาตราเดียว",
    image: "/exams/3.jpg",
    tag: "Score Report"
  },
  {
    title: "ข้อสอบระดับสีแดง Mock Test นวก.ศุล วัดความแม่นยำทุกจุด",
    description: "Mock Test ข้อสอบนักวิชาการศุลกากร สีแดงมาในรูปแบบ A B C เป็นชุดยากที่สุดที่บังทำไว้ วัดความแม่นยำทุกจุด ทุกหัวข้อที่อาจจะออกสอบ",
    image: "ข้อสอบสีแดง.png",
    tag: "ข้อสอบสีแดง"
  }
];